damowuhe/cw32l012_hal_cmake/Drivers/CW32L0xx_HAL_Driver/Inc/cw32l012_hal.h
/**
  ******************************************************************************
  * @file    cw32l012_hal.h
  * @brief   CW32L0xx HAL umbrella header
  ******************************************************************************
  */

#ifndef __CW32L012_HAL_H
#define __CW32L012_HAL_H

#ifdef __cplusplus
extern "C" {
#endif

#include "cw32l012_hal_conf.h"
#include "cw32l012_hal_gpio.h"
#include "cw32l012_hal_rcc.h"
#include "cw32l012_hal_dma.h"
#include "cw32l012_hal_uart.h"
#include "cw32l012_hal_spi.h"
#include "cw32l012_hal_i2c.h"
#include "cw32l012_hal_adc.h"
#include "cw32l012_hal_dac.h"
#include "cw32l012_hal_tim.h"
#include "cw32l012_hal_lptim.h"
#include "cw32l012_hal_halltim.h"
#include "cw32l012_hal_rtc.h"
#include "cw32l012_hal_flash.h"
#include "cw32l012_hal_pwr.h"
#include "cw32l012_hal_iwdt.h"
#include "cw32l012_hal_wwdt.h"
#include "cw32l012_hal_crc.h"
#include "cw32l012_hal_cordic.h"
#include "cw32l012_hal_eau.h"
#include "cw32l012_hal_lvd.h"
#include "cw32l012_hal_vc.h"
#include "cw32l012_hal_opa.h"
#include "cw32l012_hal_irmod.h"
#include "cw32l012_hal_debug.h"
#include "cw32l012_hal_ram.h"
#include "cw32l012_hal_digitalsign.h"

#ifdef __cplusplus
}
#endif
#endif /* __CW32L012_HAL_H */
